# -*- coding: utf-8 -*-
"""
Created on Wed Nov  7 11:31:24 2018

@author: aaaaa
"""

# -*- coding: utf-8 -*-
"""
Created on Tue Sep 25 13:52:14 2018

@author: aaaaa
"""

###############################################################################
#                         股票機器人 Python基礎教學 【數字】                         #
###############################################################################

##### 整數設定 #####
num_var = 1
num_var

##### 四則運算 #####
a = 10
b = 3

c = a + b #加
c
 
c = a - b #減
c

c = a * b #乘
c

c = a / b #除
c

c = a ** b #次方
c

c = a // b #除法取商
c

c = a % b #除法取餘數
c

##### 先乘除後加減 #####
test1 = 1 + 2 * 4  
test2 = (1 + 2) * 4  

##### 浮點數設定 #####
flo_var = 10.51162319884
flo_var