# -*- coding: utf-8 -*-
"""
Created on Tue Nov  6 18:34:47 2018

@author: aaaaa
"""

###############################################################################
#                       股票機器人 Python基礎教學 【陣列】                      #
###############################################################################

##### 陣列設定 #####
a = [1,2,3,4,5]
a

##### 陣列中取值 #####
a[4]

##### 陣列計算長度 #####
print(len(a))

##### 加入新物件 #####
a.append(7)
a.append(9)
a.append(5)
a.append('中鋼')

##### 排序 #####
a.sort()

##### 多重陣列 #####
b=['我','想','要買']
a.append(b)

##### 刪除陣列內值 #####
del a[4] #殺掉編號4裡面的內容

##### 刪除整個陣列 #####
a.clear() #清除所有東西