# -*- coding: utf-8 -*-
"""
Created on Tue Nov  6 18:34:47 2018

@author: aaaaa
"""

###############################################################################
#                       股票機器人 Python基礎教學 【字典】                      #
###############################################################################

#範例：https://bit.ly/2PRgf4F
#JSON Formatter：https://goo.gl/TiFHgf

##### 字典設定 #####
dic = {"股票代號":"2002",
       "股票名稱":{"全名":"中國鋼鐵","縮寫":"中鋼"},
       "開盤價":22,
       "收盤價":21.7,
       "最高價":22.3,
       "最低價":21.7}

##### 字典長度 #####
len(dic)

##### 取出資料 #####
dic['股票代號']



