# -*- coding: utf-8 -*-
"""
Created on Tue Nov  6 18:34:47 2018

@author: aaaaa
"""
###############################################################################
#                       股票機器人 Python基礎教學 【while迴圈】                      #
###############################################################################

##### 吐出1~10 #####
c = 0
while c <10:
    c = c + 1
    print(c)
    
##### 強制退出break #####
c = 0
while c <10:
    c = c + 1
    print(c)
    if c>6:
        break;

##### 無限迴圈 #####
while True:
    print("~~~~~~股~~~票~~~~~~")

##### 迴圈判斷 #####    
while 1 > 2:
    print('1有大於2')
else:
    print('1是小於2的')