# -*- coding: utf-8 -*-
"""
Created on Tue Nov  6 18:34:47 2018

@author: aaaaa
"""
import pandas as pd
###############################################################################
#                       股票機器人 Python基礎教學 【datatime】                      #
###############################################################################

##### 載入資料 #####
df = pd.read_csv('STOCK_DAY.csv')

##### 查看前五筆資料 #####
df.head()

##### 查看欄位資訊 #####
df.info()

##### 查看所有欄位名稱 #####
df.columns
df.columns[0] #取得單筆

##### 取得整欄 #####
df['日期']

##### 欄位統計 #####
df['開盤價'].mean() #平均
df['開盤價'].max() #最大值
df['開盤價'].min() #最小值
df['開盤價'].std() #標準差
df.describe()['開盤價'] #所有統計數字

##### 相異數量統計 #####
df['開盤價'].nunique() #共有幾種不同的開盤價
df['開盤價'].value_counts() #列出每種開盤價的個數

##### 判斷式子 #####
df[df['開盤價']>25] #列出所有開盤價大於25元的資料

##### 排序 #####
df.sort_values(['成交股數'], ascending = False)
